Tekla Open API Reference for Tekla Structures 2025
View.HorizontalLabelPosition Enumeration
 The horizontal label position types.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum HorizontalLabelPosition
Public Enumeration HorizontalLabelPosition
Members
Member name | Value | Description
CenteredByViewFrame | 1 |  The label is centered by the view frame.
CenteredByViewRestrictionBox | 2 |  The label is centered by the view restriction box.
LeftAlignedByViewFrame | 3 |  The label is left aligned by the view frame.
RightAlignedByViewFrame | 4 |  The label is right aligned by the view frame.
LeftAlignByViewRestrictionBox | 5 |  The label is left aligned by the view restriction box.
RightAlignByViewRestrictionBox | 6 |  The label is right aligned by the view restriction box.
See Also
Reference
Tekla.Structures.Drawing Namespace